{
    "class_name": "Sequential",
    "config": {
        "name": "sequential_2",
        "layers": [
            {
                "module": "keras.layers",
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        299,
                        299,
                        3
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "densenet121_input"
                },
                "registered_name": null
            },
            {
                "module": "keras.src.engine.functional",
                "class_name": "Functional",
                "config": {
                    "name": "densenet121",
                    "trainable": false,
                    "layers": [
                        {
                            "module": "keras.layers",
                            "class_name": "InputLayer",
                            "config": {
                                "batch_input_shape": [
                                    null,
                                    299,
                                    299,
                                    3
                                ],
                                "dtype": "float32",
                                "sparse": false,
                                "ragged": false,
                                "name": "input_3"
                            },
                            "registered_name": null,
                            "name": "input_3",
                            "inbound_nodes": []
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "ZeroPadding2D",
                            "config": {
                                "name": "zero_padding2d",
                                "trainable": false,
                                "dtype": "float32",
                                "padding": [
                                    [
                                        3,
                                        3
                                    ],
                                    [
                                        3,
                                        3
                                    ]
                                ],
                                "data_format": "channels_last"
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    299,
                                    299,
                                    3
                                ]
                            },
                            "name": "zero_padding2d",
                            "inbound_nodes": [
                                [
                                    [
                                        "input_3",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv1/conv",
                                "trainable": false,
                                "dtype": "float32",
                                "filters": 64,
                                "kernel_size": [
                                    7,
                                    7
                                ],
                                "strides": [
                                    2,
                                    2
                                ],
                                "padding": "valid",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "groups": 1,
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    },
                                    "registered_name": null
                                },
                                "bias_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    305,
                                    305,
                                    3
                                ]
                            },
                            "name": "conv1/conv",
                            "inbound_nodes": [
                                [
                                    [
                                        "zero_padding2d",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "conv1/bn",
                                "trainable": false,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 1.001e-05,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "gamma_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Ones",
                                    "config": {},
                                    "registered_name": null
                                },
                                "moving_mean_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "moving_variance_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Ones",
                                    "config": {},
                                    "registered_name": null
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    150,
                                    150,
                                    64
                                ]
                            },
                            "name": "conv1/bn",
                            "inbound_nodes": [
                                [
                                    [
                                        "conv1/conv",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "Activation",
                            "config": {
                                "name": "conv1/relu",
                                "trainable": false,
                                "dtype": "float32",
                                "activation": "relu"
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    150,
                                    150,
                                    64
                                ]
                            },
                            "name": "conv1/relu",
                            "inbound_nodes": [
                                [
                                    [
                                        "conv1/bn",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "ZeroPadding2D",
                            "config": {
                                "name": "zero_padding2d_1",
                                "trainable": false,
                                "dtype": "float32",
                                "padding": [
                                    [
                                        1,
                                        1
                                    ],
                                    [
                                        1,
                                        1
                                    ]
                                ],
                                "data_format": "channels_last"
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    150,
                                    150,
                                    64
                                ]
                            },
                            "name": "zero_padding2d_1",
                            "inbound_nodes": [
                                [
                                    [
                                        "conv1/relu",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "MaxPooling2D",
                            "config": {
                                "name": "pool1",
                                "trainable": false,
                                "dtype": "float32",
                                "pool_size": [
                                    3,
                                    3
                                ],
                                "padding": "valid",
                                "strides": [
                                    2,
                                    2
                                ],
                                "data_format": "channels_last"
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    152,
                                    152,
                                    64
                                ]
                            },
                            "name": "pool1",
                            "inbound_nodes": [
                                [
                                    [
                                        "zero_padding2d_1",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "conv2_block1_0_bn",
                                "trainable": false,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 1.001e-05,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "gamma_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Ones",
                                    "config": {},
                                    "registered_name": null
                                },
                                "moving_mean_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "moving_variance_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Ones",
                                    "config": {},
                                    "registered_name": null
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    75,
                                    75,
                                    64
                                ]
                            },
                            "name": "conv2_block1_0_bn",
                            "inbound_nodes": [
                                [
                                    [
                                        "pool1",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "Activation",
                            "config": {
                                "name": "conv2_block1_0_relu",
                                "trainable": false,
                                "dtype": "float32",
                                "activation": "relu"
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    75,
                                    75,
                                    64
                                ]
                            },
                            "name": "conv2_block1_0_relu",
                            "inbound_nodes": [
                                [
                                    [
                                        "conv2_block1_0_bn",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2_block1_1_conv",
                                "trainable": false,
                                "dtype": "float32",
                                "filters": 128,
                                "kernel_size": [
                                    1,
                                    1
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "valid",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "groups": 1,
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    },
                                    "registered_name": null
                                },
                                "bias_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    75,
                                    75,
                                    64
                                ]
                            },
                            "name": "conv2_block1_1_conv",
                            "inbound_nodes": [
                                [
                                    [
                                        "conv2_block1_0_relu",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "conv2_block1_1_bn",
                                "trainable": false,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 1.001e-05,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "gamma_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Ones",
                                    "config": {},
                                    "registered_name": null
                                },
                                "moving_mean_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "moving_variance_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Ones",
                                    "config": {},
                                    "registered_name": null
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    75,
                                    75,
                                    128
                                ]
                            },
                            "name": "conv2_block1_1_bn",
                            "inbound_nodes": [
                                [
                                    [
                                        "conv2_block1_1_conv",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "Activation",
                            "config": {
                                "name": "conv2_block1_1_relu",
                                "trainable": false,
                                "dtype": "float32",
                                "activation": "relu"
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    75,
                                    75,
                                    128
                                ]
                            },
                            "name": "conv2_block1_1_relu",
                            "inbound_nodes": [
                                [
                                    [
                                        "conv2_block1_1_bn",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2_block1_2_conv",
                                "trainable": false,
                                "dtype": "float32",
                                "filters": 32,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "groups": 1,
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    },
                                    "registered_name": null
                                },
                                "bias_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    75,
                                    75,
                                    128
                                ]
                            },
                            "name": "conv2_block1_2_conv",
                            "inbound_nodes": [
                                [
                                    [
                                        "conv2_block1_1_relu",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "Concatenate",
                            "config": {
                                "name": "conv2_block1_concat",
                                "trainable": false,
                                "dtype": "float32",
                                "axis": 3
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    [
                                        null,
                                        75,
                                        75,
                                        64
                                    ],
                                    [
                                        null,
                                        75,
                                        75,
                                        32
                                    ]
                                ]
                            },
                            "name": "conv2_block1_concat",
                            "inbound_nodes": [
                                [
                                    [
                                        "pool1",
                                        0,
                                        0,
                                        {}
                                    ],
                                    [
                                        "conv2_block1_2_conv",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "conv2_block2_0_bn",
                                "trainable": false,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 1.001e-05,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "gamma_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Ones",
                                    "config": {},
                                    "registered_name": null
                                },
                                "moving_mean_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "moving_variance_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Ones",
                                    "config": {},
                                    "registered_name": null
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    75,
                                    75,
                                    96
                                ]
                            },
                            "name": "conv2_block2_0_bn",
                            "inbound_nodes": [
                                [
                                    [
                                        "conv2_block1_concat",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "Activation",
                            "config": {
                                "name": "conv2_block2_0_relu",
                                "trainable": false,
                                "dtype": "float32",
                                "activation": "relu"
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    75,
                                    75,
                                    96
                                ]
                            },
                            "name": "conv2_block2_0_relu",
                            "inbound_nodes": [
                                [
                                    [
                                        "conv2_block2_0_bn",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2_block2_1_conv",
                                "trainable": false,
                                "dtype": "float32",
                                "filters": 128,
                                "kernel_size": [
                                    1,
                                    1
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "valid",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "groups": 1,
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    },
                                    "registered_name": null
                                },
                                "bias_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    75,
                                    75,
                                    96
                                ]
                            },
                            "name": "conv2_block2_1_conv",
                            "inbound_nodes": [
                                [
                                    [
                                        "conv2_block2_0_relu",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "conv2_block2_1_bn",
                                "trainable": false,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 1.001e-05,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "gamma_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Ones",
                                    "config": {},
                                    "registered_name": null
                                },
                                "moving_mean_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "moving_variance_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Ones",
                                    "config": {},
                                    "registered_name": null
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    75,
                                    75,
                                    128
                                ]
                            },
                            "name": "conv2_block2_1_bn",
                            "inbound_nodes": [
                                [
                                    [
                                        "conv2_block2_1_conv",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "Activation",
                            "config": {
                                "name": "conv2_block2_1_relu",
                                "trainable": false,
                                "dtype": "float32",
                                "activation": "relu"
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    75,
                                    75,
                                    128
                                ]
                            },
                            "name": "conv2_block2_1_relu",
                            "inbound_nodes": [
                                [
                                    [
                                        "conv2_block2_1_bn",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2_block2_2_conv",
                                "trainable": false,
                                "dtype": "float32",
                                "filters": 32,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "groups": 1,
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    },
                                    "registered_name": null
                                },
                                "bias_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    75,
                                    75,
                                    128
                                ]
                            },
                            "name": "conv2_block2_2_conv",
                            "inbound_nodes": [
                                [
                                    [
                                        "conv2_block2_1_relu",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "Concatenate",
                            "config": {
                                "name": "conv2_block2_concat",
                                "trainable": false,
                                "dtype": "float32",
                                "axis": 3
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    [
                                        null,
                                        75,
                                        75,
                                        96
                                    ],
                                    [
                                        null,
                                        75,
                                        75,
                                        32
                                    ]
                                ]
                            },
                            "name": "conv2_block2_concat",
                            "inbound_nodes": [
                                [
                                    [
                                        "conv2_block1_concat",
                                        0,
                                        0,
                                        {}
                                    ],
                                    [
                                        "conv2_block2_2_conv",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "conv2_block3_0_bn",
                                "trainable": false,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 1.001e-05,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "gamma_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Ones",
                                    "config": {},
                                    "registered_name": null
                                },
                                "moving_mean_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "moving_variance_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Ones",
                                    "config": {},
                                    "registered_name": null
                                },
